app/Services/JobCenterService.php

    public function enqueueWhatsappGroupsSync(): array
    {
        $job = $this->jobModel->getByKey('sync_whatsapp_groups');
        if (!$job || empty($job['is_active'])) {
            return [
                'success' => false,
                'message' => 'O trabalho de atualização de grupos está desativado nas configurações da Central de Trabalho.',
            ];
        }

        $groupModel = new WhatsappGroupModel();
        $groups = $groupModel->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `whatsapp_groups`
ORDER BY `id` ASC