app/Controllers/Home.php

    public function landingLeadsSettings(): string
    {
        $settingsModel = new \App\Models\LandingLeadSettingModel();
        $companyModel = new CompanyProfileModel();
        $appSettingModel = new AppSettingModel();

        $layoutSetting = $appSettingModel->where('setting_key', 'layout_max_width')->first();
---
SELECT *
FROM `app_settings`
WHERE `setting_key` = 'layout_max_width'
 LIMIT 1