app/Controllers/JobCenter.php

SELECT *
FROM `app_settings`
WHERE `setting_key` = 'layout_max_width'
 LIMIT 1
---
    private function renderPage(string $activePage, array $extraData = []): string
    {
        $item = Home::NAVIGATION[$activePage];
        $userName = trim((string) session()->get('user_name')) ?: 'Usuário';
        $nameParts = preg_split('/\s+/', $userName) ?: [$userName];
        $firstName = $nameParts[0];
        $lastName = count($nameParts) > 1 ? $nameParts[count($nameParts) - 1] : '';
        $userInitials = mb_strtoupper(mb_substr($firstName, 0, 1) . mb_substr($lastName, 0, 1));
        $setting = (new \App\Models\AppSettingModel())->where('setting_key', 'layout_max_width')->first();