app/Controllers/VipLeads.php

    private function getLeadsData(int $days, string $search = '', string $dateFilter = ''): array
    {
        $db = \Config\Database::connect();
        $leadModel = new LeadModel();

        $todayStr = date('Y-m-d');
        $yesterdayStr = date('Y-m-d', strtotime('-1 day'));

        // Consolidar totalLeads, todayCount e yesterdayCount em uma única consulta
        $overviewStats = $db->table('leads')
            ->select("
                COUNT(*) as totalLeads,
                SUM(CASE WHEN DATE(created_at) = '{$todayStr}' THEN 1 ELSE 0 END) as todayCount,
                SUM(CASE WHEN DATE(created_at) = '{$yesterdayStr}' THEN 1 ELSE 0 END) as yesterdayCount
            ")
            ->get()
            ->getRowArray();

        $totalLeads = (int) ($overviewStats['totalLeads'] ?? 0);
        $todayCount = (int) ($overviewStats['todayCount'] ?? 0);
        $yesterdayCount = (int) ($overviewStats['yesterdayCount'] ?? 0);

        // Evolução dos últimos $days dias
        $evolutionDays = [];
        $startDate = date('Y-m-d', strtotime("-" . ($days - 1) . " days"));

        $dailyStatsRaw = $db->table('leads')
            ->select("DATE(created_at) as lead_date, COUNT(id) as total")
            ->where("DATE(created_at) >=", $startDate)
            ->groupBy("DATE(created_at)")
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `leads`
WHERE DATE(created_at) = '2026-08-24'
SELECT DATE(created_at) as lead_date, COUNT(id) as total
FROM `leads`
WHERE DATE(created_at) >= '2026-08-18'
GROUP BY DATE(created_at)