sistema/app/Controllers/Home.php

        }

        $model = new \App\Models\LandingLeadSettingModel();
        $existing = $model->first();
---
SELECT *
FROM `landing_lead_settings`
 LIMIT 1