sistema/app/Controllers/Landing.php

    public function index(): string
    {
        $metaAds = (new MetaAdsSettingModel())->first();
        $settingModel = new LandingLeadSettingModel();
        $landing = $settingModel->first() ?? [
            'headline' => 'Garanta Descontos Secretos e Ofertas VIP no WhatsApp',
            'subheadline' => 'Participe do nosso grupo restrito de clientes e receba oportunidades imperdíveis de importados em primeira mão, com preços que não publicamos abertamente.',
            'badge_text' => '🔥 GRUPO VIP EXCLUSIVO • VAGAS LIMITADAS',
            'button_text' => 'QUERO MEU ACESSO VIP AGORA',
            'button_subtext' => '🔒 Acesso 100% gratuito e sem spam',
            'whatsapp_group_link' => 'https://chat.whatsapp.com/',
            'card1_icon' => 'ti-discount-check',
            'card1_title' => 'Até 50% de Desconto Real',
            'card1_desc' => 'Preços exclusivos de atacado e varejo direto para membros do grupo.',
            'card2_icon' => 'ti-flame',
            'card2_title' => 'Ofertas Relâmpago e Primeira Mão',
            'card2_desc' => 'Novidades e lançamentos liberados no grupo antes de todo mundo.',
            'card3_icon' => 'ti-shield-lock',
            'card3_title' => '100% Original e com Garantia',
            'card3_desc' => 'Importados com nota fiscal, procedência garantida e suporte humanizado.',
            'modal_title' => '🎉 Parabéns! Seu Acesso VIP Está Liberado',
            'modal_desc' => 'Seu cadastro foi realizado com sucesso. Clique no botão abaixo para entrar agora no Grupo VIP Oficial no WhatsApp e não perder nenhuma oportunidade.',
            'modal_button_text' => 'ENTRAR NO GRUPO VIP DO WHATSAPP',
        ];

        $company = (new CompanyProfileModel())->first();
---
SELECT *
FROM `meta_ads_settings`
 LIMIT 1
SELECT *
FROM `landing_lead_settings`
 LIMIT 1
SELECT *
FROM `company_profile`
 LIMIT 1