sistema/app/Controllers/Users.php

SELECT *
FROM `users`
ORDER BY `id` ASC
SELECT *
FROM `app_settings`
WHERE `setting_key` = 'layout_max_width'
 LIMIT 1
---
    public function index(): string
    {
        $userModel = new UserModel();
        $users = $userModel->orderBy('id', 'ASC')->findAll();

        $currentUserId = (int) session()->get('user_id');
        $counts = [
            'total' => count($users),
            'active' => 0,
            'inactive' => 0,
            'admin' => 0,
        ];

        foreach ($users as $u) {
            if ((int) $u['is_active'] === 1) {
                $counts['active']++;
            } else {
                $counts['inactive']++;
            }
            if (($u['role'] ?? 'user') === 'admin') {
                $counts['admin']++;
            }
        }

        $layoutSetting = (new \App\Models\AppSettingModel())->where('setting_key', 'layout_max_width')->first();