sistema/app/Models/SystemJobQueueModel.php

    public function getQueueStats(): array
    {
        $db = \Config\Database::connect();
        $builder = $db->table($this->table);
        $counts = $builder->select('status, COUNT(*) as total')
                          ->groupBy('status')
                          ->get()
                          ->getResultArray();
---
SELECT `status`, COUNT(*) as total
FROM `system_job_queue`
GROUP BY `status`